<a href="https://colab.research.google.com/github/christinezuzart/Learning/blob/main/Pandas_Refresher.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("/content/sample_data/california_housing_train.csv")

In [3]:
df

       longitude  latitude  ...  median_income  median_house_value
0        -114.31     34.19  ...         1.4936             66900.0
1        -114.47     34.40  ...         1.8200             80100.0
2        -114.56     33.69  ...         1.6509             85700.0
3        -114.57     33.64  ...         3.1917             73400.0
4        -114.57     33.57  ...         1.9250             65500.0
...          ...       ...  ...            ...                 ...
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[17000 rows x 9 columns]

In [4]:
df.shape

(17000, 9)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17000 entries, 0 to 16999
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           17000 non-null  float64
 1   latitude            17000 non-null  float64
 2   housing_median_age  17000 non-null  float64
 3   total_rooms         17000 non-null  float64
 4   total_bedrooms      17000 non-null  float64
 5   population          17000 non-null  float64
 6   households          17000 non-null  float64
 7   median_income       17000 non-null  float64
 8   median_house_value  17000 non-null  float64
dtypes: float64(9)
memory usage: 1.2 MB

In [6]:
df.head()

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0

[5 rows x 9 columns]

In [7]:
df.head(10)

   longitude  latitude  ...  median_income  median_house_value
0    -114.31     34.19  ...         1.4936             66900.0
1    -114.47     34.40  ...         1.8200             80100.0
2    -114.56     33.69  ...         1.6509             85700.0
3    -114.57     33.64  ...         3.1917             73400.0
4    -114.57     33.57  ...         1.9250             65500.0
5    -114.58     33.63  ...         3.3438             74000.0
6    -114.58     33.61  ...         2.6768             82400.0
7    -114.59     34.83  ...         1.7083             48500.0
8    -114.59     33.61  ...         2.1782             58400.0
9    -114.60     34.83  ...         2.1908             48100.0

[10 rows x 9 columns]

In [8]:
df.tail(10)

       longitude  latitude  ...  median_income  median_house_value
16990    -124.22     41.73  ...         1.7038             78300.0
16991    -124.23     41.75  ...         2.4805             73200.0
16992    -124.23     40.81  ...         3.3462             50800.0
16993    -124.23     40.54  ...         3.0806            106700.0
16994    -124.25     40.28  ...         1.9417             76100.0
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[10 rows x 9 columns]

# Creating dataframes from dictionaries

In [9]:
people = {'first':['Mary', 'John', "Tiya"],
          'last':['Turner', 'Doe', 'Roza']}

In [10]:
df = pd.DataFrame(people)

In [11]:
df

  first    last
0  Mary  Turner
1  John     Doe
2  Tiya    Roza

In [12]:
df['last']

0    Turner
1       Doe
2      Roza
Name: last, dtype: object

In [13]:
type(df['last'])

pandas.core.series.Series

# Using [ ] is preferable over '.' it may happen to access the method

In [14]:
df.last

<bound method NDFrame.last of   first    last
0  Mary  Turner
1  John     Doe
2  Tiya    Roza>

In [15]:
df[['last', 'first']]

     last first
0  Turner  Mary
1     Doe  John
2    Roza  Tiya

In [16]:
df.columns

Index(['first', 'last'], dtype='object')

# Accessing rows by integer location

### Here indexes are the column names

In [17]:
df.iloc[0]

first      Mary
last     Turner
Name: 0, dtype: object

# Accesing multiple rows

In [18]:
df.iloc[[0,2]]

  first    last
0  Mary  Turner
2  Tiya    Roza

In [19]:
df.iloc[[0,2], 1]

0    Turner
2      Roza
Name: last, dtype: object

#Accessing rows by labels

In [20]:
df.loc[0]

first      Mary
last     Turner
Name: 0, dtype: object

In [21]:
df.loc[[0,1]]

  first    last
0  Mary  Turner
1  John     Doe

In [22]:
df.loc[[0,1],'last']

0    Turner
1       Doe
Name: last, dtype: object

In [23]:
df.loc[[0,1],['last', 'first']]

     last first
0  Turner  Mary
1     Doe  John

In [24]:
sample = {'Hobby':['Y', 'N', 'Y', 'N', 'Y', 'N', 'Y', 'N', 'Y', 'N', 'Y', 'N','N', 'N']}

In [25]:
df_sample = pd.DataFrame(sample)

In [26]:
df_sample['Hobby']

0     Y
1     N
2     Y
3     N
4     Y
5     N
6     Y
7     N
8     Y
9     N
10    Y
11    N
12    N
13    N
Name: Hobby, dtype: object

In [27]:
df_sample['Hobby'].value_counts()

N    8
Y    6
Name: Hobby, dtype: int64

In [28]:
df = pd.read_csv("/content/sample_data/california_housing_train.csv")

In [29]:
df

       longitude  latitude  ...  median_income  median_house_value
0        -114.31     34.19  ...         1.4936             66900.0
1        -114.47     34.40  ...         1.8200             80100.0
2        -114.56     33.69  ...         1.6509             85700.0
3        -114.57     33.64  ...         3.1917             73400.0
4        -114.57     33.57  ...         1.9250             65500.0
...          ...       ...  ...            ...                 ...
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[17000 rows x 9 columns]

In [30]:
df.loc[0,'total_rooms']

5612.0

In [31]:
df.loc[[0,1,2],'total_rooms']

0    5612.0
1    7650.0
2     720.0
Name: total_rooms, dtype: float64

#Slicing

In [32]:
df.loc[0:2,'total_rooms']

0    5612.0
1    7650.0
2     720.0
Name: total_rooms, dtype: float64

In [33]:
df.loc[0:2,'total_rooms': 'median_income']

   total_rooms  total_bedrooms  population  households  median_income
0       5612.0          1283.0      1015.0       472.0         1.4936
1       7650.0          1901.0      1129.0       463.0         1.8200
2        720.0           174.0       333.0       117.0         1.6509

In [34]:
df.set_index('total_rooms')

             longitude  latitude  ...  median_income  median_house_value
total_rooms                       ...
5612.0         -114.31     34.19  ...         1.4936             66900.0
7650.0         -114.47     34.40  ...         1.8200             80100.0
720.0          -114.56     33.69  ...         1.6509             85700.0
1501.0         -114.57     33.64  ...         3.1917             73400.0
1454.0         -114.57     33.57  ...         1.9250             65500.0
...                ...       ...  ...            ...                 ...
2217.0         -124.26     40.58  ...         2.3571            111400.0
2349.0         -124.27     40.69  ...         2.5179             79000.0
2677.0         -124.30     41.84  ...         3.0313            103600.0
2672.0         -124.30     41.80  ...         1.9797             85800.0
1820.0         -124.35     40.54  ...         3.0147             94600.0

[17000 rows x 8 columns]

In [35]:
df

       longitude  latitude  ...  median_income  median_house_value
0        -114.31     34.19  ...         1.4936             66900.0
1        -114.47     34.40  ...         1.8200             80100.0
2        -114.56     33.69  ...         1.6509             85700.0
3        -114.57     33.64  ...         3.1917             73400.0
4        -114.57     33.57  ...         1.9250             65500.0
...          ...       ...  ...            ...                 ...
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[17000 rows x 9 columns]

In [36]:
df.set_index('total_rooms', inplace = True)

In [37]:
df

             longitude  latitude  ...  median_income  median_house_value
total_rooms                       ...
5612.0         -114.31     34.19  ...         1.4936             66900.0
7650.0         -114.47     34.40  ...         1.8200             80100.0
720.0          -114.56     33.69  ...         1.6509             85700.0
1501.0         -114.57     33.64  ...         3.1917             73400.0
1454.0         -114.57     33.57  ...         1.9250             65500.0
...                ...       ...  ...            ...                 ...
2217.0         -124.26     40.58  ...         2.3571            111400.0
2349.0         -124.27     40.69  ...         2.5179             79000.0
2677.0         -124.30     41.84  ...         3.0313            103600.0
2672.0         -124.30     41.80  ...         1.9797             85800.0
1820.0         -124.35     40.54  ...         3.0147             94600.0

[17000 rows x 8 columns]

In [38]:
df.index

Float64Index([5612.0, 7650.0,  720.0, 1501.0, 1454.0, 1387.0, 2907.0,  812.0,
              4789.0, 1497.0,
              ...
              3003.0, 3159.0, 1112.0, 2694.0, 1430.0, 2217.0, 2349.0, 2677.0,
              2672.0, 1820.0],
             dtype='float64', name='total_rooms', length=17000)

In [39]:
df.loc[1820.0]

             longitude  latitude  ...  median_income  median_house_value
total_rooms                       ...
1820.0         -116.68     33.16  ...         2.1797            156300.0
1820.0         -117.18     34.05  ...         2.6129            137000.0
1820.0         -117.29     34.15  ...         3.2976            102600.0
1820.0         -122.13     37.87  ...        10.3713            426100.0
1820.0         -124.35     40.54  ...         3.0147             94600.0

[5 rows x 8 columns]

In [40]:
df.loc[1820.0, 'longitude']

total_rooms
1820.0   -116.68
1820.0   -117.18
1820.0   -117.29
1820.0   -122.13
1820.0   -124.35
Name: longitude, dtype: float64

In [41]:
df.reset_index(inplace=True)

In [42]:
df

       total_rooms  longitude  ...  median_income  median_house_value
0           5612.0    -114.31  ...         1.4936             66900.0
1           7650.0    -114.47  ...         1.8200             80100.0
2            720.0    -114.56  ...         1.6509             85700.0
3           1501.0    -114.57  ...         3.1917             73400.0
4           1454.0    -114.57  ...         1.9250             65500.0
...            ...        ...  ...            ...                 ...
16995       2217.0    -124.26  ...         2.3571            111400.0
16996       2349.0    -124.27  ...         2.5179             79000.0
16997       2677.0    -124.30  ...         3.0313            103600.0
16998       2672.0    -124.30  ...         1.9797             85800.0
16999       1820.0    -124.35  ...         3.0147             94600.0

[17000 rows x 9 columns]

In [43]:
df = pd.read_csv("/content/sample_data/california_housing_train.csv", index_col = 'total_rooms')

In [44]:
df.head()

             longitude  latitude  ...  median_income  median_house_value
total_rooms                       ...
5612.0         -114.31     34.19  ...         1.4936             66900.0
7650.0         -114.47     34.40  ...         1.8200             80100.0
720.0          -114.56     33.69  ...         1.6509             85700.0
1501.0         -114.57     33.64  ...         3.1917             73400.0
1454.0         -114.57     33.57  ...         1.9250             65500.0

[5 rows x 8 columns]

In [45]:
df.sort_index()

             longitude  latitude  ...  median_income  median_house_value
total_rooms                       ...
2.0            -117.79     35.21  ...         2.3750            137500.0
8.0            -122.50     37.79  ...        15.0001            500001.0
11.0           -118.44     34.28  ...         2.8750            162500.0
12.0           -122.29     37.81  ...         0.4999             67500.0
15.0           -122.37     37.60  ...         5.0480            350000.0
...                ...       ...  ...            ...                 ...
30401.0        -117.12     33.52  ...         4.5841            212300.0
30405.0        -118.78     34.16  ...         8.0137            399200.0
32054.0        -117.78     34.03  ...         6.0191            253900.0
32627.0        -121.79     36.64  ...         2.3087            118800.0
37937.0        -117.74     33.89  ...         7.4947            366300.0

[17000 rows x 8 columns]

In [46]:
df.index.value_counts()

1582.0     16
1527.0     15
1717.0     14
1471.0     14
1703.0     14
           ..
157.0       1
2760.0      1
458.0       1
10239.0     1
4068.0      1
Name: total_rooms, Length: 5533, dtype: int64

In [47]:
df.sort_index(ascending=False)

             longitude  latitude  ...  median_income  median_house_value
total_rooms                       ...
37937.0        -117.74     33.89  ...         7.4947            366300.0
32627.0        -121.79     36.64  ...         2.3087            118800.0
32054.0        -117.78     34.03  ...         6.0191            253900.0
30405.0        -118.78     34.16  ...         8.0137            399200.0
30401.0        -117.12     33.52  ...         4.5841            212300.0
...                ...       ...  ...            ...                 ...
15.0           -118.04     33.90  ...         0.4999            162500.0
12.0           -122.29     37.81  ...         0.4999             67500.0
11.0           -118.44     34.28  ...         2.8750            162500.0
8.0            -122.50     37.79  ...        15.0001            500001.0
2.0            -117.79     35.21  ...         2.3750            137500.0

[17000 rows x 8 columns]

# Filtering - Using Conditionals to Filter Rows and Columns

In [48]:
df['total_bedrooms'] == 5

total_rooms
5612.0    False
7650.0    False
720.0     False
1501.0    False
1454.0    False
          ...
2217.0    False
2349.0    False
2677.0    False
2672.0    False
1820.0    False
Name: total_bedrooms, Length: 17000, dtype: bool

In [49]:
filt = (df['total_bedrooms'] == 5)

In [50]:
df_filt = df[filt]

In [51]:
df_filt

             longitude  latitude  ...  median_income  median_house_value
total_rooms                       ...
25.0           -117.19     32.75  ...         0.5360            162500.0
20.0           -117.86     33.67  ...         3.8750            450000.0
15.0           -118.04     33.90  ...         0.4999            162500.0
50.0           -121.96     37.13  ...        15.0001            400000.0

[4 rows x 8 columns]

In [52]:
df.loc[filt]

             longitude  latitude  ...  median_income  median_house_value
total_rooms                       ...
25.0           -117.19     32.75  ...         0.5360            162500.0
20.0           -117.86     33.67  ...         3.8750            450000.0
15.0           -118.04     33.90  ...         0.4999            162500.0
50.0           -121.96     37.13  ...        15.0001            400000.0

[4 rows x 8 columns]

In [53]:
df.loc[filt,'population']

total_rooms
25.0    13.0
20.0    15.0
15.0    15.0
50.0    17.0
Name: population, dtype: float64

In [54]:
filt = (df['total_bedrooms'] == 5) & (df['population'] == 15)

In [55]:
df[filt]

             longitude  latitude  ...  median_income  median_house_value
total_rooms                       ...
20.0           -117.86     33.67  ...         3.8750            450000.0
15.0           -118.04     33.90  ...         0.4999            162500.0

[2 rows x 8 columns]

In [56]:
filt = (df['total_bedrooms'] == 5) | (df['population'] == 15)

In [57]:
df[filt]

             longitude  latitude  ...  median_income  median_house_value
total_rooms                       ...
25.0           -117.19     32.75  ...         0.5360            162500.0
20.0           -117.86     33.67  ...         3.8750            450000.0
15.0           -118.04     33.90  ...         0.4999            162500.0
50.0           -121.96     37.13  ...        15.0001            400000.0

[4 rows x 8 columns]

In [58]:
df[~filt]

             longitude  latitude  ...  median_income  median_house_value
total_rooms                       ...
5612.0         -114.31     34.19  ...         1.4936             66900.0
7650.0         -114.47     34.40  ...         1.8200             80100.0
720.0          -114.56     33.69  ...         1.6509             85700.0
1501.0         -114.57     33.64  ...         3.1917             73400.0
1454.0         -114.57     33.57  ...         1.9250             65500.0
...                ...       ...  ...            ...                 ...
2217.0         -124.26     40.58  ...         2.3571            111400.0
2349.0         -124.27     40.69  ...         2.5179             79000.0
2677.0         -124.30     41.84  ...         3.0313            103600.0
2672.0         -124.30     41.80  ...         1.9797             85800.0
1820.0         -124.35     40.54  ...         3.0147             94600.0

[16996 rows x 8 columns]

In [59]:
many_beds = (df['total_bedrooms'] > 1000)

In [60]:
df.loc[many_beds]

             longitude  latitude  ...  median_income  median_house_value
total_rooms                       ...
5612.0         -114.31     34.19  ...         1.4936             66900.0
7650.0         -114.47     34.40  ...         1.8200             80100.0
4789.0         -114.59     33.61  ...         2.1782             58400.0
3868.0         -115.85     34.20  ...         1.3571             41000.0
10377.0        -116.06     34.15  ...         2.2466             66800.0
...                ...       ...  ...            ...                 ...
5569.0         -123.22     39.28  ...         3.1455            142900.0
5372.0         -123.34     39.10  ...         3.0652            131100.0
5409.0         -123.49     38.70  ...         3.3125            295400.0
5202.0         -123.59     38.80  ...         3.1201            176100.0
5694.0         -124.19     40.73  ...         3.5363             90100.0

[1576 rows x 8 columns]

In [61]:
df.loc[many_beds,['population','households']]

             population  households
total_rooms
5612.0           1015.0       472.0
7650.0           1129.0       463.0
4789.0           3134.0      1056.0
3868.0            890.0       423.0
10377.0          4507.0      1807.0
...                 ...         ...
5569.0           3148.0      1088.0
5372.0           3002.0       992.0
5409.0            594.0       327.0
5202.0           1742.0       803.0
5694.0           2907.0       972.0

[1576 rows x 2 columns]

In [62]:
age = ['10','20','30']
filt = df['housing_median_age'].isin(age)

In [63]:
df.loc[filt,'housing_median_age']

total_rooms
1454.0    20.0
1491.0    20.0
350.0     20.0
1602.0    30.0
1402.0    20.0
          ...
1075.0    20.0
2673.0    20.0
1895.0    30.0
2975.0    30.0
3810.0    20.0
Name: housing_median_age, Length: 993, dtype: float64

# Updating Rows and Columns - Modifying Data Within DataFrames

In [64]:
people = {'first':['Mary', 'John', 'Tiya'],
          'last':['Turner', 'Doe', 'Roza'],
          'email':['Mary.T@gmail.com', 'John.D@gmail.com', 'Tiya.R@gmail.com']}

In [65]:
df_ppl = pd.DataFrame(people)

In [66]:
df_ppl

  first    last             email
0  Mary  Turner  Mary.T@gmail.com
1  John     Doe  John.D@gmail.com
2  Tiya    Roza  Tiya.R@gmail.com

In [67]:
df_ppl.columns = ['first_name', 'last_name', 'email']

In [68]:
df_ppl

  first_name last_name             email
0       Mary    Turner  Mary.T@gmail.com
1       John       Doe  John.D@gmail.com
2       Tiya      Roza  Tiya.R@gmail.com

In [69]:
df_ppl.columns = [x.upper() for x in df_ppl.columns]

In [70]:
df_ppl

  FIRST_NAME LAST_NAME             EMAIL
0       Mary    Turner  Mary.T@gmail.com
1       John       Doe  John.D@gmail.com
2       Tiya      Roza  Tiya.R@gmail.com

In [71]:
df_ppl.columns = df_ppl.columns.str.replace('_', ' ')

In [72]:
df_ppl.columns

Index(['FIRST NAME', 'LAST NAME', 'EMAIL'], dtype='object')

In [73]:
df_ppl.columns = df_ppl.columns.str.replace('  ', '_')

In [74]:
df_ppl

  FIRST NAME LAST NAME             EMAIL
0       Mary    Turner  Mary.T@gmail.com
1       John       Doe  John.D@gmail.com
2       Tiya      Roza  Tiya.R@gmail.com

In [75]:
df_ppl.columns = [x.lower() for x in df_ppl.columns]

In [76]:
df_ppl

  first name last name             email
0       Mary    Turner  Mary.T@gmail.com
1       John       Doe  John.D@gmail.com
2       Tiya      Roza  Tiya.R@gmail.com

In [77]:
df_ppl.rename(columns= {'first name':'first', 'last name':'last'})

  first    last             email
0  Mary  Turner  Mary.T@gmail.com
1  John     Doe  John.D@gmail.com
2  Tiya    Roza  Tiya.R@gmail.com

In [78]:
df_ppl.rename(columns= {'first name':'first', 'last name':'last'}, inplace=True)

In [79]:
df_ppl

  first    last             email
0  Mary  Turner  Mary.T@gmail.com
1  John     Doe  John.D@gmail.com
2  Tiya    Roza  Tiya.R@gmail.com

#Updating data in a row

In [80]:
df_ppl.loc[2] = ['Tiya', 'Smith', 'Tiya.S@gmail.com']

In [81]:
df_ppl

  first    last             email
0  Mary  Turner  Mary.T@gmail.com
1  John     Doe  John.D@gmail.com
2  Tiya   Smith  Tiya.S@gmail.com

# Changing onl specific column values in a row

In [82]:
df_ppl.loc[2,['last','email']] = ['Roza', 'Tiya.R@gmail.com']

In [83]:
df_ppl

  first    last             email
0  Mary  Turner  Mary.T@gmail.com
1  John     Doe  John.D@gmail.com
2  Tiya    Roza  Tiya.R@gmail.com

In [84]:
df_ppl.loc[2,'last'] = 'Smith'

In [85]:
df_ppl

  first    last             email
0  Mary  Turner  Mary.T@gmail.com
1  John     Doe  John.D@gmail.com
2  Tiya   Smith  Tiya.R@gmail.com

In [86]:
df_ppl.at[2,'last'] = 'Roza'

In [87]:
df_ppl

  first    last             email
0  Mary  Turner  Mary.T@gmail.com
1  John     Doe  John.D@gmail.com
2  Tiya    Roza  Tiya.R@gmail.com

In [88]:
filt = (df_ppl['email'] == 'Tiya.R@gmail.com')
df_ppl[filt]

  first  last             email
2  Tiya  Roza  Tiya.R@gmail.com

In [89]:
df_ppl[filt]['last'] = 'Smith'

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [90]:
df_ppl

  first    last             email
0  Mary  Turner  Mary.T@gmail.com
1  John     Doe  John.D@gmail.com
2  Tiya    Roza  Tiya.R@gmail.com

In [91]:
df_ppl.loc[filt,'last'] = 'Smith'

In [92]:
df_ppl

  first    last             email
0  Mary  Turner  Mary.T@gmail.com
1  John     Doe  John.D@gmail.com
2  Tiya   Smith  Tiya.R@gmail.com

In [93]:
df_ppl['email'] = df_ppl['email'].str.lower()
df_ppl

  first    last             email
0  Mary  Turner  mary.t@gmail.com
1  John     Doe  john.d@gmail.com
2  Tiya   Smith  tiya.r@gmail.com

# Methods for updating
apply
map
applymap
replace

In [94]:
df_ppl['email'].apply(len)

0    16
1    16
2    16
Name: email, dtype: int64

In [95]:
def update_email(email):
    return email.upper()

In [96]:
df_ppl['email'].apply(update_email)

0    MARY.T@GMAIL.COM
1    JOHN.D@GMAIL.COM
2    TIYA.R@GMAIL.COM
Name: email, dtype: object

In [97]:
df_ppl['email'] = df_ppl['email'].apply(update_email)
df_ppl

  first    last             email
0  Mary  Turner  MARY.T@GMAIL.COM
1  John     Doe  JOHN.D@GMAIL.COM
2  Tiya   Smith  TIYA.R@GMAIL.COM

In [98]:
df_ppl['email'] = df_ppl['email'].apply(lambda x: x.lower())
df_ppl

  first    last             email
0  Mary  Turner  mary.t@gmail.com
1  John     Doe  john.d@gmail.com
2  Tiya   Smith  tiya.r@gmail.com

In [99]:
df_ppl['email'].apply(len)

0    16
1    16
2    16
Name: email, dtype: int64

In [100]:
df_ppl.apply(len)

first    3
last     3
email    3
dtype: int64

In [101]:
len(df_ppl['email'])

3

In [102]:
df_ppl.apply(len, axis='columns')

0    3
1    3
2    3
dtype: int64

In [103]:
df_ppl.apply(pd.Series.min)

first                John
last                  Doe
email    john.d@gmail.com
dtype: object

In [104]:
df_ppl.apply(lambda x : x.min())

first                John
last                  Doe
email    john.d@gmail.com
dtype: object

In [105]:
df_ppl.applymap(len)

   first  last  email
0      4     6     16
1      4     3     16
2      4     5     16

In [106]:
df_ppl.applymap(str.lower)

  first    last             email
0  mary  turner  mary.t@gmail.com
1  john     doe  john.d@gmail.com
2  tiya   smith  tiya.r@gmail.com

In [107]:
df_ppl['first'].map({'Mary':'Kori', 'John':'Johnny'})

0      Kori
1    Johnny
2       NaN
Name: first, dtype: object

In [108]:
df_ppl

  first    last             email
0  Mary  Turner  mary.t@gmail.com
1  John     Doe  john.d@gmail.com
2  Tiya   Smith  tiya.r@gmail.com

In [109]:
df_ppl['first'].replace({'Mary':'Kori', 'John':'Johnny'})

0      Kori
1    Johnny
2      Tiya
Name: first, dtype: object

In [110]:
df_ppl

  first    last             email
0  Mary  Turner  mary.t@gmail.com
1  John     Doe  john.d@gmail.com
2  Tiya   Smith  tiya.r@gmail.com

In [111]:
df_ppl['first']= df_ppl['first'].replace({'Mary':'Kori', 'John':'Johnny'})

In [112]:
df_ppl

    first    last             email
0    Kori  Turner  mary.t@gmail.com
1  Johnny     Doe  john.d@gmail.com
2    Tiya   Smith  tiya.r@gmail.com

In [113]:
df_sample

   Hobby
0      Y
1      N
2      Y
3      N
4      Y
5      N
6      Y
7      N
8      Y
9      N
10     Y
11     N
12     N
13     N

In [114]:
df_sample['Hobby'].map({'Y':True, 'N':False})

0      True
1     False
2      True
3     False
4      True
5     False
6      True
7     False
8      True
9     False
10     True
11    False
12    False
13    False
Name: Hobby, dtype: bool

In [115]:
df_sample['Hobby'] = df_sample['Hobby'].map({'Y':True, 'N':False})

In [116]:
df_sample

    Hobby
0    True
1   False
2    True
3   False
4    True
5   False
6    True
7   False
8    True
9   False
10   True
11  False
12  False
13  False